# Berkeley Data
**goal: calculate a pivot table with absolute and relative frequencies**

In [2]:
import pandas as pd
import seaborn as sns
from matplotlib import pyplot as plt

In [10]:
# df = pd.read_csv(r"C:\Users\Kristian\myprojects\berkeley.csv")
df = pd.read_csv("/home/kristian/Desktop/data/berkeley.csv")
df.head()

   Year  Major Gender Admission
0  1973      C      F  Rejected
1  1973      B      M  Accepted
2  1973  Other      F  Accepted
3  1973  Other      M  Accepted
4  1973  Other      M  Rejected

In [11]:
df.shape

(12763, 4)

In [13]:
pivot = pd.pivot_table(data=df, index="Gender", columns="Admission",
               values="Major", aggfunc="count") #--> absolute freq
pivot

Admission  Accepted  Rejected
Gender
F              1494      2827
M              3738      4704

In [16]:
pivot / pivot.sum().sum()

Admission  Accepted  Rejected
Gender
F          0.117057  0.221500
M          0.292878  0.368565

In [17]:
pivot / pivot.sum()

Admission  Accepted  Rejected
Gender
F           0.28555  0.375382
M           0.71445  0.624618